FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
static BaseType_t prvAcceptPacket( const NetworkBufferDescriptor_t * const pxDescriptor );

static BaseType_t prvGetPhyLinkStatus( NetworkInterface_t * pxInterface );

static BaseType_t prvPhyReadReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t * pulValue );

static BaseType_t prvPhyWriteReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t ulValue );

static void prvEthernetUpdateConfig( ETH_HandleTypeDef * pxEthHandle );

static void prvMACAddressConfig( ETH_HandleTypeDef * pxEthHandle, const uint8_t * Addr );

/*-----------------------------------------------------------*/

static ETH_HandleTypeDef xEthHandle;

static ETH_DMADescTypeDef xDMADescRx[ ETH_RX_DESC_CNT ] __ALIGNED( portBYTE_ALIGNMENT ) __attribute__( ( section( niEMAC_RX_DESC_SECTION ) ) );

static ETH_DMADescTypeDef xDMADescTx[ ETH_TX_DESC_CNT ] __ALIGNED( portBYTE_ALIGNMENT ) __attribute__( ( section( niEMAC_TX_DESC_SECTION ) ) );

static NetworkInterface_t * pxMyInterface = NULL;

static TaskHandle_t xEMACTaskHandle;

static SemaphoreHandle_t xTxMutex, xTxDescSem;

static EthernetPhy_t xPhyObject;

static const PhyProperties_t xPHYProperties = {
    #if ( niEMAC_AUTO_NEGOTIATION != 0 )
        .ucSpeed = PHY_SPEED_AUTO,
        .ucDuplex = PHY_DUPLEX_AUTO,
    #else
        #if ( niEMAC_USE_100MB != 0 )
            .ucSpeed = PHY_SPEED_100,
        #else
            .ucSpeed = PHY_SPEED_10,
        #endif

        #if ( niEMAC_USE_FULL_DUPLEX != 0 )
            .ucDuplex = PHY_DUPLEX_FULL,
        #else
            .ucDuplex = PHY_DUPLEX_HALF,
        #endif
    #endif /* if ( niEMAC_AUTO_NEGOTIATION != 0 ) */

    #if ( niEMAC_AUTO_NEGOTIATION != 0 ) && ( niEMAC_AUTO_CROSS != 0 )
        .ucMDI_X = PHY_MDIX_AUTO,
    #elif ( niEMAC_CROSSED_LINK != 0 )
        .ucMDI_X = PHY_MDIX_CROSSED,
    #else
        .ucMDI_X = PHY_MDIX_DIRECT,
    #endif
};

/*-----------------------------------------------------------*/

/* Compute the CRC32 of the given MAC address as per IEEE 802.3 CRC32 */
static uint32_t prvComputeCRC32_MAC( const uint8_t * pucMAC )
{
    uint32_t ulCRC32 = 0xFFFFFFFF;

    for( UBaseType_t i = 0; i < 6; ++i )
    {
        ulCRC32 ^= ( uint32_t ) pucMAC[ i ];

        for( UBaseType_t j = 0; j < 8; ++j )
        {
            ulCRC32 >>= 1;
            if( ulCRC32 & 1 )
            {
                /* IEEE 802.3 CRC32 polynomial - 0x04C11DB7 */
                ulCRC32 ^= __RBIT( 0x04C11DB7 );
            }
        }
    }

    ulCRC32 = ~( ulCRC32 );
    return ulCRC32;
}

/*-----------------------------------------------------------*/

/* Compute the hash value of a given MAC address to index the bits in the Hash Table
 * Registers (ETH_MACHT0R and ETH_MACHT1R) */
static uint32_t prvComputeEthernet_MACHash( const uint8_t * pucMAC )
{
    /* Calculate the 32-bit CRC for the MAC */
    const uint32_t ulCRC32 = prvComputeCRC32_MAC( pucMAC );

    /* Perform bitwise reversal on the CRC32 */
    const uint32_t ulHash = __RBIT( ulCRC32 );

    /* Take the upper 6 bits of the above result */
    return ( ulHash >> 26 );
}

/*-----------------------------------------------------------*/

/* Update the Hash Table Registers
 * (ETH_MACHT0R and ETH_MACHT1R) with hash value of the given MAC address */
static void prvSetMAC_HashFilter( ETH_HandleTypeDef * pxEthHandle, const uint8_t * pucMAC )
{
    static uint32_t ulHashTable[2];

    const uint32_t ulHash = prvComputeEthernet_MACHash( pucMAC );

    /* Use the upper (MACHT1R) or lower (MACHT0R) Hash Table Registers
     * to set the required bit based on the ulHash */
    if( ulHash < 32 )
    {
        ulHashTable[0] = ulHash;
    }
    else
    {
        ulHashTable[1] = ulHash;
    }

    const HAL_StatusTypeDef xHalResult = HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
    configASSERT( xHalResult == HAL_OK );
    (void) xHalResult;
}

/*-----------------------------------------------------------*/

void vNetworkInterfaceAllocateRAMToBuffers( NetworkBufferDescriptor_t pxNetworkBuffers[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ] )
{
    static uint8_t ucNetworkPackets[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ][ niEMAC_TOTAL_BUFFER_SIZE ] __ALIGNED( niEMAC_CACHE_LINE_SIZE ) __attribute__( ( section( niEMAC_BUFFERS_SECTION ) ) );

    configASSERT( xBufferAllocFixedSize == pdTRUE );

    for( size_t ul = 0; ul < ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS; ++ul )
    {
        pxNetworkBuffers[ ul ].pucEthernetBuffer = &( ucNetworkPackets[ ul ][ ipBUFFER_PADDING ] );
        *( ( uint32_t * ) &( ucNetworkPackets[ ul ][ 0 ] ) ) = ( uint32_t ) ( &( pxNetworkBuffers[ ul ] ) );
    }
}

/*-----------------------------------------------------------*/

NetworkInterface_t * pxSTM32_FillInterfaceDescriptor( BaseType_t xEMACIndex, NetworkInterface_t * pxInterface )
{
    static char pcName[ 17 ];

    ( void ) snprintf( pcName, sizeof( pcName ), "eth%u", ( unsigned ) xEMACIndex );

    ( void ) memset( pxInterface, '\0', sizeof( *pxInterface ) );
    pxInterface->pcName = pcName;
    pxInterface->pvArgument = ( void * ) xEMACIndex;
    pxInterface->pfInitialise = prvNetworkInterfaceInitialise;
    pxInterface->pfOutput = prvNetworkInterfaceOutput;
    pxInterface->pfGetPhyLinkStatus = prvGetPhyLinkStatus;

    ( void ) FreeRTOS_AddNetworkInterface( pxInterface );

    pxMyInterface = pxInterface;

    return pxInterface;
}

/*-----------------------------------------------------------*/

static BaseType_t prvGetPhyLinkStatus( NetworkInterface_t * pxInterface )
{
    ( void ) pxInterface;

    BaseType_t xReturn = pdFALSE;

    if( xPhyObject.ulLinkStatusMask != 0U )
    {
        xReturn = pdTRUE;
    }

    return xReturn;
}

/*-----------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInitialise( NetworkInterface_t * pxInterface )
{
    BaseType_t xInitResult = pdFAIL;
    BaseType_t xResult;
    HAL_StatusTypeDef xHalResult;

    static eMAC_INIT_STATUS_TYPE xMacInitStatus = eMacEthInit;

    switch( xMacInitStatus )
    {
        default:
            configASSERT( pdFALSE );
            break;

        case eMacEthInit:
            xEthHandle.Instance = ETH;

            NetworkEndPoint_t * pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface );
            if( pxEndPoint == NULL )
            {
                break;
            }

            xEthHandle.Init.MACAddr = ( uint8_t * ) pxEndPoint->xMACAddress.ucBytes;
            #if ( niEMAC_USE_RMII != 0 )
                xEthHandle.Init.MediaInterface = HAL_ETH_RMII_MODE;
            #else
                xEthHandle.Init.MediaInterface = HAL_ETH_MII_MODE;
            #endif
            xEthHandle.Init.TxDesc = xDMADescTx;
            xEthHandle.Init.RxDesc = xDMADescRx;
            xEthHandle.Init.RxBuffLen = niEMAC_DATA_BUFFER_SIZE;
            configASSERT( xEthHandle.Init.RxBuffLen <= ETH_MAX_PACKET_SIZE );

