FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
            ( void ) memset( &xDMADescTx, 0, sizeof( xDMADescTx ) );
            ( void ) memset( &xDMADescRx, 0, sizeof( xDMADescRx ) );

            #if defined( STM32F7 ) || defined( STM32F4 )
                /* This function doesn't get called in Fxx driver */
                HAL_ETH_SetMDIOClockRange( &xEthHandle );
            #endif

            xHalResult = HAL_ETH_Init( &xEthHandle );
            if( xHalResult != HAL_OK )
            {
                /* &xEthHandle != NULL
                xEthHandle.ErrorCode == HAL_ETH_ERROR_TIMEOUT */
                break;
            }
            configASSERT( xEthHandle.ErrorCode == HAL_ETH_ERROR_NONE );
            configASSERT( xEthHandle.gState == HAL_ETH_STATE_READY );

            #if 0
                ETH_MACFilterConfigTypeDef xFilterConfig;
                xHalResult = HAL_ETH_GetMACFilterConfig( &xEthHandle, &xFilterConfig );
                configASSERT( xHalResult == HAL_OK );

                xFilterConfig.HashUnicast = ENABLE;
                xFilterConfig.HashMulticast = ENABLE;
                xHalResult = HAL_ETH_SetMACFilterConfig( &xEthHandle, &xFilterConfig );
                configASSERT( xHalResult == HAL_OK );
            #endif

            #if ( ipconfigUSE_MDNS != 0 )
                prvMACAddressConfig( &xEthHandle, ( uint8_t * ) xMDNS_MacAddress.ucBytes );
                #if ( ipconfigUSE_IPv6 != 0 )
                    prvMACAddressConfig( &xEthHandle, ( uint8_t * ) xMDNS_MACAddressIPv6.ucBytes );
                #endif
            #endif

            #if ( ipconfigUSE_LLMNR != 0 )
                prvMACAddressConfig( &xEthHandle, ( uint8_t * ) xLLMNR_MacAddress.ucBytes );
                #if ( ipconfigUSE_IPv6 != 0 )
                    prvMACAddressConfig( &xEthHandle, ( uint8_t * ) xLLMNR_MacAddressIPv6.ucBytes );
                #endif
            #endif

            for(; pxEndPoint != NULL; pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
            {
                #if ( ipconfigUSE_IPv6 != 0 )
                    if( pxEndPoint->bits.bIPv6 != pdFALSE_UNSIGNED )
                    {
                        const uint8_t ucMACAddress[ ipMAC_ADDRESS_LENGTH_BYTES ] = {
                            0x33,
                            0x33,
                            0xff,
                            pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ 13 ],
                            pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ 14 ],
                            pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ 15 ]
                        };
                        prvMACAddressConfig( &xEthHandle, ucMACAddress );
                    }
                #else
                    if( xEthHandle.Init.MACAddr != ( uint8_t * ) pxEndPoint->xMACAddress.ucBytes )
                    {
                        prvMACAddressConfig( &xEthHandle, pxEndPoint->xMACAddress.ucBytes );
                    }
                #endif /* if ( ipconfigUSE_IPv6 != 0 ) */
            }

            #if ( ipconfigUSE_IPv6 != 0 )
                const uint8_t ucMACAddress[ ipMAC_ADDRESS_LENGTH_BYTES ] = { 0x33, 0x33, 0, 0, 0, 0x01 };
                prvMACAddressConfig( &xEthHandle, ucMACAddress );
            #endif

            xMacInitStatus = eMacPhyInit;
            /* fallthrough */

        case eMacPhyInit:
            vPhyInitialise( &xPhyObject, ( xApplicationPhyReadHook_t ) prvPhyReadReg, ( xApplicationPhyWriteHook_t ) prvPhyWriteReg );

            xResult = xPhyDiscover( &xPhyObject );
            if( xResult == 0 )
            {
                break;
            }

            xMacInitStatus = eMacPhyStart;
            /* fallthrough */

        case eMacPhyStart:
            xResult = xPhyConfigure( &xPhyObject, &xPHYProperties );
            if( xResult != 0 )
            {
                break;
            }

            if( prvGetPhyLinkStatus( pxInterface ) == pdFALSE )
            {
                #if ( niEMAC_AUTO_NEGOTIATION != 0 )
                    /* TODO: xPhyStartAutoNegotiation always returns 0, Should return -1 if xPhyGetMask == 0 ? */
                    xResult = xPhyStartAutoNegotiation( &xPhyObject, xPhyGetMask( &xPhyObject ) );
                #else
                    /* Use predefined (fixed) configuration. */
                    xResult = xPhyFixedValue( &xPhyObject, xPhyGetMask( &xPhyObject ) );
                #endif

                configASSERT( xResult == 0 );
                if ( prvGetPhyLinkStatus( pxInterface ) == pdFALSE )
                {
                    break;
                }
            }

            ETH_MACConfigTypeDef xMACConfig;
            xHalResult = HAL_ETH_GetMACConfig( &xEthHandle , &xMACConfig );
            configASSERT( xHalResult == HAL_OK );
            if( xHalResult != HAL_OK )
            {
                break;
            }
            xMACConfig.DuplexMode = ( xPhyObject.xPhyProperties.ucDuplex == PHY_DUPLEX_FULL ) ? ETH_FULLDUPLEX_MODE : ETH_HALFDUPLEX_MODE;
            xMACConfig.Speed = ( xPhyObject.xPhyProperties.ucSpeed == PHY_SPEED_10 ) ? ETH_SPEED_10M : ETH_SPEED_100M;
            xMACConfig.ChecksumOffload = ( FunctionalState ) ( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM != 0 );
            xHalResult = HAL_ETH_SetMACConfig( &xEthHandle, &xMACConfig );
            configASSERT( xHalResult == HAL_OK );
            if( xHalResult != HAL_OK )
            {
                break;
            }

            xMacInitStatus = eMacTaskStart;
            /* fallthrough */

        case eMacTaskStart:
            if( xTxMutex == NULL )
            {
                #if ( configSUPPORT_STATIC_ALLOCATION != 0 )
                    static StaticSemaphore_t xTxMutexBuf;
                    xTxMutex = xSemaphoreCreateMutexStatic( &xTxMutexBuf );
                #else
                    xTxMutex = xSemaphoreCreateMutex();
                #endif
                configASSERT( xTxMutex != NULL );
                if( xTxMutex == NULL )
                {
                    break;
                }
                vQueueAddToRegistry( xTxMutex, niEMAC_TX_MUTEX_NAME );
            }

            if( xTxDescSem == NULL )
            {
                #if ( configSUPPORT_STATIC_ALLOCATION != 0 )
                    static StaticSemaphore_t xTxDescSemBuf;
                    xTxDescSem = xSemaphoreCreateCountingStatic(
                        ( UBaseType_t ) ETH_TX_DESC_CNT,
                        ( UBaseType_t ) ETH_TX_DESC_CNT,
                        &xTxDescSemBuf
                    );
                #else
                    xTxDescSem = xSemaphoreCreateCounting(
                        ( UBaseType_t ) ETH_TX_DESC_CNT,
                        ( UBaseType_t ) ETH_TX_DESC_CNT
                    );
                #endif
                configASSERT( xTxDescSem != NULL );
                if( xTxDescSem == NULL )
                {
                    break;
                }
                vQueueAddToRegistry( xTxDescSem, niEMAC_TX_DESC_SEM_NAME );
            }

            if( xEMACTaskHandle == NULL )
            {
                #if ( configSUPPORT_STATIC_ALLOCATION != 0 )
                    static StackType_t uxEMACTaskStack[ niEMAC_TASK_STACK_SIZE ];
                    static StaticTask_t xEMACTaskTCB;
                    xEMACTaskHandle = xTaskCreateStatic(
                        prvEMACHandlerTask,
                        niEMAC_TASK_NAME,
                        niEMAC_TASK_STACK_SIZE,
                        ( void * ) &xEthHandle,
                        niEMAC_TASK_PRIORITY,
                        uxEMACTaskStack,
                        &xEMACTaskTCB
                    );
                #else
                    xResult = xTaskCreate(
                        prvEMACHandlerTask,
                        niEMAC_TASK_NAME,
                        niEMAC_TASK_STACK_SIZE,
                        ( void * ) &xEthHandle,
                        niEMAC_TASK_PRIORITY,
                        &xEMACTaskHandle
                    );
                    configASSERT( xResult == pdPASS );
                #endif
                configASSERT( xEMACTaskHandle != NULL );
                if( xEMACTaskHandle == NULL )
                {
                    break;
                }
            }

