FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
            xMacInitStatus = eMacEthStart;
            /* fallthrough */

        case eMacEthStart:
            if( xEthHandle.gState != HAL_ETH_STATE_STARTED )
            {
                xHalResult = HAL_ETH_Start_IT( &xEthHandle );
                configASSERT( xHalResult == HAL_OK );
                if( xHalResult != HAL_OK )
                {
                    break;
                }
            }
            configASSERT( xEthHandle.gState == HAL_ETH_STATE_STARTED );
            configASSERT( xEthHandle.RxDescList.ItMode == 1U );

            xMacInitStatus = eMacInitComplete;
            /* fallthrough */

        case eMacInitComplete:
            configASSERT( xEthHandle.gState != HAL_ETH_STATE_ERROR );
            if( prvGetPhyLinkStatus( pxInterface ) == pdTRUE )
            {
                xInitResult = pdPASS;
            }
    }

    return xInitResult;
}

/*-----------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceOutput( NetworkInterface_t * pxInterface, NetworkBufferDescriptor_t * const pxDescriptor, BaseType_t xReleaseAfterSend )
{
    BaseType_t xResult = pdFAIL;
    configASSERT( pxDescriptor != NULL );
    /* Zero-Copy Only */
    configASSERT( xReleaseAfterSend != pdFALSE );
    iptraceNETWORK_INTERFACE_OUTPUT( pxDescriptor->xDataLength, pxDescriptor->pucEthernetBuffer );

    if( ( pxDescriptor != NULL ) && ( pxDescriptor->pucEthernetBuffer != NULL ) && ( pxDescriptor->xDataLength <= niEMAC_DATA_BUFFER_SIZE ) )
    {
        if( prvGetPhyLinkStatus( pxInterface ) != pdFAIL )
        {
            static ETH_TxPacketConfig xTxConfig = {
                .CRCPadCtrl = ETH_CRC_PAD_INSERT,
                #if ( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM != 0 )
                    .Attributes = ETH_TX_PACKETS_FEATURES_CRCPAD | ETH_TX_PACKETS_FEATURES_CSUM,
                    .ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC,
                #else
                    .Attributes = ETH_TX_PACKETS_FEATURES_CRCPAD,
                    .ChecksumCtrl = ETH_CHECKSUM_DISABLE,
                #endif
            };

            ETH_BufferTypeDef xTxBuffer = {
                .buffer = ( uint8_t * ) pxDescriptor->pucEthernetBuffer,
                .len = pxDescriptor->xDataLength,
                .next = NULL
            };
            configASSERT( xTxBuffer.len <= ETH_MAX_PACKET_SIZE );

            xTxConfig.Length = xTxBuffer.len;
            xTxConfig.TxBuffer = &xTxBuffer;
            xTxConfig.pData = pxDescriptor;

            if( xSemaphoreTake( xTxDescSem, pdMS_TO_TICKS( niEMAC_DESCRIPTOR_WAIT_TIME_MS ) ) != pdFALSE )
            {
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( 50U ) ) != pdFALSE )
                {
                    HAL_StatusTypeDef xHalResult = HAL_ETH_Transmit_IT( &xEthHandle, &xTxConfig );
                    xSemaphoreGive( xTxMutex );
                    if( xHalResult == HAL_OK )
                    {
                        /* Released later in deferred task by calling HAL_ETH_ReleaseTxPacket */
                        xReleaseAfterSend = pdFALSE;
                        xResult = pdPASS;
                    }
                    else
                    {
                        ( void ) xSemaphoreGive( xTxDescSem );
                        configASSERT( xEthHandle.ErrorCode != HAL_ETH_ERROR_PARAM );
                        if( xEthHandle.gState != HAL_ETH_STATE_STARTED )
                        {
                            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Eth Not Started\n" ) );
                        }
                        if( xEthHandle.ErrorCode & HAL_ETH_ERROR_BUSY )
                        {
                            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Tx Busy\n" ) );
                            xHalResult = HAL_ETH_ReleaseTxPacket( &xEthHandle );
                            configASSERT( xHalResult == HAL_OK );
                        }
                    }
                }
                else
                {
                    xSemaphoreGive( xTxDescSem );
                    FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Process Busy\n" ) );
                }
            }
            else
            {
                FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: No Descriptors Available\n" ) );
            }
        }
        else
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Link Down\n" ) );
        }
    }
    else
    {
        FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Invalid Buffer\n" ) );
    }

    if( ( pxDescriptor != NULL ) && ( xReleaseAfterSend != pdFALSE ) )
    {
        vReleaseNetworkBufferAndDescriptor( pxDescriptor );
    }

    /*if( xResult == pdFAIL )
    {
        FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Failed\n" ) );
        xTaskNotify( xEMACTaskHandle, eMacEventErrTx, eSetBits );
    }*/

    return xResult;
}

/*-----------------------------------------------------------*/

static UBaseType_t prvNetworkInterfaceInput( void )
{
    UBaseType_t xResult = 0;
    #if ( ipconfigUSE_LINKED_RX_MESSAGES != 0 )
        NetworkBufferDescriptor_t * pxStartDescriptor = NULL;
        NetworkBufferDescriptor_t * pxEndDescriptor = NULL;
    #endif
    NetworkBufferDescriptor_t * pxCurDescriptor = NULL;

    while ( ( HAL_ETH_ReadData( &xEthHandle, ( void ** ) &pxCurDescriptor ) == HAL_OK ) )
    {
        /* configASSERT( xEthHandle.RxDescList.RxDataLength <= niEMAC_DATA_BUFFER_SIZE ); */
        if( pxCurDescriptor == NULL )
        {
            /* Buffer was dropped, ignore packet */
            continue;
        }
        iptraceNETWORK_INTERFACE_INPUT( pxCurDescriptor->xDataLength, pxCurDescriptor->pucEthernetBuffer );
        ++xResult;
        pxCurDescriptor->pxInterface = pxMyInterface;
        pxCurDescriptor->pxEndPoint = FreeRTOS_MatchingEndpoint( pxCurDescriptor->pxInterface, pxCurDescriptor->pucEthernetBuffer );
        /* TODO: check pxEndPoint exists? Check it earlier before getting buffer? */
        #if ( ipconfigUSE_LINKED_RX_MESSAGES != 0 )
            if ( pxStartDescriptor == NULL )
            {
                pxStartDescriptor = pxCurDescriptor;
            }
            else if ( pxEndDescriptor != NULL )
            {
                pxEndDescriptor->pxNextBuffer = pxCurDescriptor;
            }
            pxEndDescriptor = pxCurDescriptor;
        #else
            xRxEvent.pvData = ( void * ) pxCurDescriptor;
            if( xSendEventStructToIPTask( &xRxEvent, ( TickType_t ) 20U ) != pdPASS )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvNetworkInterfaceInput: xSendEventStructToIPTask failed\n" ) );
                vReleaseNetworkBufferAndDescriptor( pxCurDescriptor );
            }
        #endif
    }

    #if ( ipconfigUSE_LINKED_RX_MESSAGES != 0 )
        if( xResult > 0 )
        {
            const IPStackEvent_t xRxEvent = {
                .eEventType = eNetworkRxEvent,
                .pvData = ( void * ) pxStartDescriptor,
            };
            if( xSendEventStructToIPTask( &xRxEvent, niEMAC_MAX_BLOCK_TIME_MS ) != pdPASS )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvNetworkInterfaceInput: xSendEventStructToIPTask failed\n" ) );
                NetworkBufferDescriptor_t * pxDescriptorToClear = pxStartDescriptor;
                do {
                    NetworkBufferDescriptor_t * pxNext = pxDescriptorToClear->pxNextBuffer;
                    vReleaseNetworkBufferAndDescriptor( pxDescriptorToClear );
                    pxDescriptorToClear = pxNext;
                } while( pxDescriptorToClear != NULL );
            }
        }
    #endif

    if( xResult == 0 )
    {
        ( void ) xTaskNotify( xEMACTaskHandle, eMacEventErrRx, eSetBits );
    }

    configASSERT( xEthHandle.ErrorCode != HAL_ETH_ERROR_PARAM );
    if( xEthHandle.gState != HAL_ETH_STATE_STARTED )
    {
        ( void ) xTaskNotify( xEMACTaskHandle, eMacEventErrEth, eSetBits );
    }

