FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    return ( ( BaseType_t ) ( xResult > 0 ) );
}

/*-----------------------------------------------------------*/

static portTASK_FUNCTION( prvEMACHandlerTask, pvParameters )
{
    ETH_HandleTypeDef * pxEthHandle = ( ETH_HandleTypeDef * ) pvParameters;
    configASSERT( pxEthHandle );

    for( ;; )
    {
        BaseType_t xResult = 0U;
        uint32_t ulISREvents = 0U;

        if ( xTaskNotifyWait( 0U, eMacEventAll, &ulISREvents, pdMS_TO_TICKS( niEMAC_MAX_BLOCK_TIME_MS ) ) == pdTRUE )
        {
            HAL_StatusTypeDef xHalResult;

            if( ( ulISREvents & eMacEventRx ) != 0 )
            {
                xResult = ( prvNetworkInterfaceInput() > 0 );
            }

            if( ( ulISREvents & eMacEventTx ) != 0 )
            {
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( 1000U ) ) != pdFALSE )
                {
                    xHalResult = HAL_ETH_ReleaseTxPacket( pxEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    ( void ) xSemaphoreGive( xTxMutex );
                }
            }
            if( ( ulISREvents & eMacEventErrTx ) != 0 )
            {
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( 1000U ) ) != pdFALSE )
                {
                    xHalResult = HAL_ETH_ReleaseTxPacket( pxEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    while( ETH_TX_DESC_CNT - uxQueueMessagesWaiting( ( QueueHandle_t ) xTxDescSem ) > pxEthHandle->TxDescList.BuffersInUse )
                    {
                        ( void ) xSemaphoreGive( xTxDescSem );
                    }
                }
            }

            if( ( ulISREvents & eMacEventErrRx ) != 0 )
            {
                /*do {
                    xResult = ( prvNetworkInterfaceInput() > 0 );
                } while ( xResult != pdFALSE );
                xResult = pdTRUE;*/
            }

            if( ( ulISREvents & eMacEventErrEth ) != 0 )
            {
                /* pxEthHandle->gState */
                /* pxEthHandle->ErrorCode */
            }

            if( ( ulISREvents & eMacEventErrMac ) != 0 )
            {
                /* pxEthHandle->MACErrorCode */
            }

            if( ( ulISREvents & eMacEventErrDma ) != 0 )
            {
                /* TODO: Does this recover from fatal bus error? */
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( 5000U ) ) != pdFALSE )
                {
                    /* pxEthHandle->DMAErrorCode */
                    pxEthHandle->gState = HAL_ETH_STATE_STARTED;
                    xHalResult = HAL_ETH_Stop_IT( pxEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    configASSERT( pxEthHandle->gState == HAL_ETH_STATE_READY );
                    configASSERT( pxEthHandle->RxDescList.ItMode == 0U);
                    xHalResult = HAL_ETH_DeInit( pxEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    configASSERT( pxEthHandle->gState == HAL_ETH_STATE_RESET );
                    xHalResult = HAL_ETH_Init( pxEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    configASSERT( pxEthHandle->ErrorCode == HAL_ETH_ERROR_NONE );
                    configASSERT( pxEthHandle->gState == HAL_ETH_STATE_READY );
                    xHalResult = HAL_ETH_Start_IT( pxEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    configASSERT( pxEthHandle->gState == HAL_ETH_STATE_STARTED );
                    configASSERT( pxEthHandle->RxDescList.ItMode == 1U);
                    xSemaphoreGive( xTxMutex );
                }
            }

            (void) xHalResult;
        }

        if( xPhyCheckLinkStatus( &xPhyObject, xResult ) != pdFALSE )
        {
            if( pxEthHandle->gState != HAL_ETH_STATE_BUSY )
            {
                prvEthernetUpdateConfig( pxEthHandle );
            }
        }
    }
}

/*-----------------------------------------------------------*/

static BaseType_t prvAcceptPacket( const NetworkBufferDescriptor_t * const pxDescriptor )
{
    BaseType_t xResult = pdFALSE;

    uint32_t pErrorCode = 0;
    const HAL_StatusTypeDef xHalResult = HAL_ETH_GetRxDataErrorCode( &xEthHandle, &pErrorCode );
    configASSERT( xHalResult == HAL_OK );
    (void) xHalResult;

    /* Fxx - ETH_DMARXDESC_DBE | ETH_DMARXDESC_RE | ETH_DMARXDESC_OE | ETH_DMARXDESC_RWT | ETH_DMARXDESC_LC | ETH_DMARXDESC_CE | ETH_DMARXDESC_DE | ETH_DMARXDESC_IPV4HCE */
    /* Hxx - ETH_DMARXNDESCWBF_DE | ETH_DMARXNDESCWBF_RE | ETH_DMARXNDESCWBF_OE | ETH_DMARXNDESCWBF_RWT | ETH_DMARXNDESCWBF_GP | ETH_DMARXNDESCWBF_CE */

    if ( pErrorCode == 0 )
    {
        /* ipconfigETHERNET_DRIVER_FILTERS_PACKETS, ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES */
        /* ETH_IP_PAYLOAD_UNKNOWN */
        const eFrameProcessingResult_t xFrameProcessingResult = niEMAC_CONSIDER_FRAME_FOR_PROCESSING( pxDescriptor->pucEthernetBuffer );
        if( xFrameProcessingResult == eProcessBuffer )
        {
            xResult = pdTRUE;
        }
        else
        {
            /* Other Enum Values Are Invalid */
            configASSERT( xFrameProcessingResult == eReleaseBuffer );
        }
    }

    return xResult;
}

/*-----------------------------------------------------------*/

static BaseType_t prvPhyReadReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t * pulValue )
{
    BaseType_t xResult = pdTRUE;

    if( HAL_ETH_ReadPHYRegister( &xEthHandle, ( uint32_t ) xAddress, ( uint32_t ) xRegister, pulValue ) == HAL_OK )
    {
        xResult = pdFALSE;
    }

    return xResult;
}

/*-----------------------------------------------------------*/

static BaseType_t prvPhyWriteReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t ulValue )
{
    BaseType_t xResult = pdTRUE;

    if( HAL_ETH_WritePHYRegister( &xEthHandle, ( uint32_t ) xAddress, ( uint32_t ) xRegister, ulValue ) == HAL_OK )
    {
        xResult = pdFALSE;
    }

    return xResult;
}

/*-----------------------------------------------------------*/

